tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# YAML Parser
brew "libyaml"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Run arbitrary commands when files change
brew "entr"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq", link: true
# Library to render SVG files using Cairo
brew "librsvg"
# Mac App Store command-line interface
brew "mas"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple NodeJS versions
brew "nodenv"
# Object-relational database system
brew "postgresql@15"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Soak up standard input and write to a file
brew "sponge"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Cut and paste files in Finder
cask "command-x"
# Customise menu item keyboard shortcuts
cask "customshortcuts"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# Grammarly for desktop
cask "grammarly-desktop"
# Tool to optimize images to a smaller size
cask "imageoptim"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Modified browser that helps in responsive web development
cask "responsively"
# Collect, organize & share colors
cask "sip"
# Team communication and collaboration software
cask "slack"
# SSH client
cask "termius"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Toggl Track", id: 1291898086
mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onelight"
vscode "be5invis.vscode-custom-css"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "Dylbill.math-on-all-numbers"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-optimize-images"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hogashi.crontab-syntax-highlight"
vscode "idleberg.applescript"
vscode "jock.svg"
vscode "mikestead.dotenv"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.live-server"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rubocop.vscode-rubocop"
vscode "timonwong.shellcheck"
vscode "ultram4rine.vscode-choosealicense"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "vortizhe.simple-ruby-erb"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"
